Revit 2027 API
SpotDimension.SpotDimensionType Property
 The dimension style of this dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotDimensionType SpotDimensionType { get; set; }
Public Property SpotDimensionType As SpotDimensionType
	Get
	Set
public:
property SpotDimensionType^ SpotDimensionType {
	SpotDimensionType^ get ();
	void set (SpotDimensionType^ value);
}
member SpotDimensionType : SpotDimensionType with get, set
Property Value
SpotDimensionType
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace